//Текст задания # 1
//1. Установить расширение форматирования кода
//2. Установить расширение “JavaScript Snippet Pack”
//3. Сделайте файл с вашей первой программой.
//a. index.html
//b. script.js
//4. Подключите файл script.js к index.html
//5. В файле index.html создайте скрипт который выводит в
//консоль текст “Текст из index.html”
//6. В файле script.js вывести в консоль текст “Текст из
//script.js!

// console.log('Текст из script.js!');

// Текст задания # 2
/*1. Создайте переменную num и присвойте ей значение 123. Выведите
значение этой переменной в консоль*/

/*let num = 123;
let a = 5;
a = 7
let b = 1 + 2 + 3;
console.log(b);

*/

/*2. Создайте переменную а и присвойте ей значение 5, переопределите
переменную а на значение 7, выведите переменную а в консоль
3. Создайте переменную b. Запишите в нее сумму чисел 1, 2 и 3. С
помощью функции console.log выведите в консоль содержимое/переменной b.
4. Создайте 2 вида комментариев в вашем коде, добавьте в них
произвольный текст */

/*Текст задания # 3
Создайте переменную c со значением 10 и переменную d со
значением 2.

let c = 10;
let d = 2;
let summa = c + d;
let difference = c - d;
let composition = c * d;
let division = c / d;
console.log(summa);
console.log(difference);
console.log(composition);
console.log(division);
console.log(summa + difference + composition + division);
/*
a. Все созданные переменные должны быть логично названы
b. Создайте переменную суммы и присвойте сумму чисел (c,d)
c. Создайте переменную разности и присвойте разность чисел
(c,d)
d. Создайте переменную прозведения и присвойте произведение
чисел (c,d)
e. Создайте переменную частного и присвойте деление чисел
(c,d)
f. Выведите в консоль все созданные переменные
g. Сложите все созданные переменные и выведите результат в
консоль*/

 /*Задание 4
1. Не запуская код, определите, что выведется в консоль:
a. let a = 5 + 5 * 3 + 3;    23
2. Не запуская код, определите, что выведется в консоль:
a. let a = 8 / 2 + 2;    6
3. Не запуская код, определите, что выведется в консоль:
a. let a = (2 + 3) * (2 + 3);  25
4. Не запуская код, определите, что выведется в консоль:
a. let a = (2 + 3) * 2 + 3;  13
5. Не запуская код, определите, что выведется в консоль:
a. let a = (2 * 8) / 4;  4
6. Не запуская код, определите, что выведется в консоль:
a. let a = 2 * (8 / 4);  4
*/

/* Задание 5 
1. Запишите в переменную a число 1.5, а в переменную b - число 0.75.
Найдите сумму значений этих переменных и выведите ее на экран.

let a = 1.5;
let b = 0.75;
console.log(a + b);

2. Создайте переменную a, запишите в нее какое-нибудь
положительное или отрицательное число. Выведите на экран это
число с обратным знаком.

let a = - 1.5;
console.log(a * (-1));
*/

/*Задание 6 
1. Создайте строку с вашем именем и строку с вашей фамилией.
Выведите эти данные в консоль

let name = "Anton";
let first_name = "Dyachkov";
console.log(name + " " + first_name);
*/
/*
2. Создайте переменную с текстом 'java' и переменную с текстом
'script'. С помощью этих переменных и операции сложения строк
выведите в консоль строку 'javascript'.

let string_1 = 'java';
let string_2 = 'script';
console.log(string_1 + string_2);
*/

/*
3. Создайте переменную с текстом 'hello' и переменную с текстом
'world'. С помощью этих переменных и операции сложения строк
выведите в консоль строку 'hello world'


let string_1 = 'hello';
let string_2 = 'world';
console.log(string_1 + " " + string_2);
*/